In [1]:
import pandas as pd
import sklearn as sk

In [2]:
test_df = pd.read_csv('./test.csv')
train_df = pd.read_csv('./train.csv')

test_df.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

In [3]:
test_n = len(test_df['PassengerId'].values)
train_n = len(test_df['PassengerId'].values)

print("test: {0} train: {1}".format(test_n, train_n))

test: 418 train: 418


remove unesscary coloumns

In [4]:
test_df.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
del test_df['Ticket']
del train_df['Ticket']

del test_df['PassengerId']
del train_df['PassengerId']

del test_df['Name']
del train_df['Name']

In [6]:
test_df.head(10)

   Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0       3    male  34.5      0      0   7.8292   NaN        Q
1       3  female  47.0      1      0   7.0000   NaN        S
2       2    male  62.0      0      0   9.6875   NaN        Q
3       3    male  27.0      0      0   8.6625   NaN        S
4       3  female  22.0      1      1  12.2875   NaN        S
5       3    male  14.0      0      0   9.2250   NaN        S
6       3  female  30.0      0      0   7.6292   NaN        Q
7       2    male  26.0      1      1  29.0000   NaN        S
8       3  female  18.0      0      0   7.2292   NaN        C
9       3    male  21.0      2      0  24.1500   NaN        S

In [7]:
test_df['Cabin'].unique()

array([nan, 'B45', 'E31', 'B57 B59 B63 B66', 'B36', 'A21', 'C78', 'D34',
       'D19', 'A9', 'D15', 'C31', 'C23 C25 C27', 'F G63', 'B61', 'C53',
       'D43', 'C130', 'C132', 'C101', 'C55 C57', 'B71', 'C46', 'C116', 'F',
       'A29', 'G6', 'C6', 'C28', 'C51', 'E46', 'C54', 'C97', 'D22', 'B10',
       'F4', 'E45', 'E52', 'D30', 'B58 B60', 'E34', 'C62 C64', 'A11',
       'B11', 'C80', 'F33', 'C85', 'D37', 'C86', 'D21', 'C89', 'F E46',
       'A34', 'D', 'B26', 'C22 C26', 'B69', 'C32', 'B78', 'F E57', 'F2',
       'A18', 'C106', 'B51 B53 B55', 'D10 D12', 'E60', 'E50', 'E39 E41',
       'B52 B54 B56', 'C39', 'B24', 'D28', 'B41', 'C7', 'D40', 'D38',
       'C105'], dtype=object)

In [8]:
test_df['Cabin'].value_counts()

B57 B59 B63 B66    3
C78                2
C116               2
E34                2
A34                2
C89                2
C6                 2
C31                2
C101               2
B45                2
C80                2
C23 C25 C27        2
F4                 2
C55 C57            2
B71                1
C32                1
C86                1
G6                 1
C39                1
D10 D12            1
E60                1
F E46              1
D30                1
E46                1
D43                1
C53                1
A9                 1
D15                1
C46                1
C97                1
                  ..
F G63              1
B52 B54 B56        1
D40                1
B78                1
C85                1
E31                1
C7                 1
F33                1
D34                1
A18                1
C105               1
C130               1
B69                1
D28                1
B58 B60            1
F2                 1
B26                1
B51 B53 B55        1
C54                1
C28                1
D19                1
D38                1
B61                1
D21                1
C106               1
A29                1
E45                1
F E57              1
C51                1
C132               1
Name: Cabin, Length: 76, dtype: int64

not many samples and hard the quantify

In [9]:
del test_df['Cabin']
del train_df['Cabin']

In [10]:
test_df.head(10)

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S
5       3    male  14.0      0      0   9.2250        S
6       3  female  30.0      0      0   7.6292        Q
7       2    male  26.0      1      1  29.0000        S
8       3  female  18.0      0      0   7.2292        C
9       3    male  21.0      2      0  24.1500        S

In [11]:
test_df['Embarked'].unique()

array(['Q', 'S', 'C'], dtype=object)

map to numeric

In [12]:
test_df['Embarked'] = test_df['Embarked'].map({'Q': 0, 'S': 1, 'C': 2})
train_df['Embarked'] = train_df['Embarked'].map({'Q': 0, 'S': 1, 'C': 2})

test_df.head(5)

   Pclass     Sex   Age  SibSp  Parch     Fare  Embarked
0       3    male  34.5      0      0   7.8292         0
1       3  female  47.0      1      0   7.0000         1
2       2    male  62.0      0      0   9.6875         0
3       3    male  27.0      0      0   8.6625         1
4       3  female  22.0      1      1  12.2875         1

In [13]:
test_df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [14]:
test_df['Sex'] = test_df['Sex'].map({'male': 0, 'female': 1})
train_df['Sex'] = train_df['Sex'].map({'male': 0, 'female': 1})

test_df.head(5)

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    0  34.5      0      0   7.8292         0
1       3    1  47.0      1      0   7.0000         1
2       2    0  62.0      0      0   9.6875         0
3       3    0  27.0      0      0   8.6625         1
4       3    1  22.0      1      1  12.2875         1

In [15]:
train_df.head(2)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    0  22.0      1      0   7.2500       1.0
1         1       1    1  38.0      1      0  71.2833       2.0

In [16]:
train_df.isnull().any()

Survived    False
Pclass      False
Sex         False
Age          True
SibSp       False
Parch       False
Fare        False
Embarked     True
dtype: bool

In [17]:
print(train_df['Age'].isnull().sum())
print(train_df['Age'].mean())

177
29.6991176471

In [18]:
train_df['Age'] = train_df['Age'].fillna(train_df['Age'].mean())

train_df.isnull().any()

Survived    False
Pclass      False
Sex         False
Age         False
SibSp       False
Parch       False
Fare        False
Embarked     True
dtype: bool

In [19]:
train_df['Embarked'].isnull().sum()

2

In [20]:
train_df.count()

Survived    891
Pclass      891
Sex         891
Age         891
SibSp       891
Parch       891
Fare        891
Embarked    889
dtype: int64

remove two null Embarked rows

In [21]:
train_df = train_df[~train_df['Embarked'].isnull()]
train_df.count()

Survived    889
Pclass      889
Sex         889
Age         889
SibSp       889
Parch       889
Fare        889
Embarked    889
dtype: int64

In [23]:
train_df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    0  22.0      1      0   7.2500       1.0
1         1       1    1  38.0      1      0  71.2833       2.0
2         1       3    1  26.0      0      0   7.9250       1.0
3         1       1    1  35.0      1      0  53.1000       1.0
4         0       3    0  35.0      0      0   8.0500       1.0

In [25]:
train_df.where(train_df['Parch'] == 0).count()

Survived    676
Pclass      676
Sex         676
Age         676
SibSp       676
Parch       676
Fare        676
Embarked    676
dtype: int64